{"templateIndex":3,"sharedHashesByProp":{},"data":{"posts":[{"id":"cjw3oywwiy0h4083056hw4dbv","title":"Top 10 JavaScript Charting Libraries for Every Data Visualization","image":{"handle":"mTtdw8iLSq3hceAHoG0w"},"content":"Nowadays, the amount of data grows exponentially, and the more information we see, the harder it gets to process it. That’s why we need data visualization — in charts and dashboards, preferably interactive. It helps us humans save a lot of time and effort to view, analyze, and understand data, and make the right, informed decisions based on that.\n\nIn the modern HTML5 web, one can hardly deny that JavaScript is the most versatile and simplest technology to make use of for visualizing data. So if you are a front-end web developer, you either already know what JS charts are all about, or your first task to make them will come in a (short) while.\n\nThere are numerous JavaScript charting libraries out there, each with their specific pros and cons as with any tools. To make your life easier, I decided to tell you about my favorite ones. I think the following ten are the best JS libraries for creating charts and can be really helpful in solving one or another particular data visualization task, whether it’s basic or advanced. Follow me and check them out to make sure you know the basics about them and have not missed out on some good one for your current or next big project.\n\n- Chartist.js.\n- FusionCharts.\n- Dygraphs.\n- Chart.js.\n- Google Charts.\n- Highcharts.\n- Flot.\n- D3.js.","tags":["Javascript","React","Coding"],"author":{"id":"cjw3ol2t4xzoc0830ejrx7ksb","name":"Sandip Guchait"}},{"id":"cjw3p22mvy0o00830lgyr73la","title":"How I Started in Web Development","image":{"handle":"jSkmJTu2TYCWVL5qgvXz"},"content":"Around half of the world’s population goes on the web every single day, but how many people actually know how it works or the skills necessary do to any form of web development.\n\nA few months ago, I developed a website for one of my family members on Weebly. I was dragging and dropping elements on the webpage. And even though I didn’t actually code the site, I felt extremely proud of myself when I had finished building it. Two months later, I decided to start learning about web development, and that is when my adventure began!\n\nIf you aspire to become a web developer and you don’t know where to start, or not sure about what to learn, you’ll find all the fundamentals you need to master to become a web developer in this article.\n\nSometimes, I think of that day when I started programming, and I look where I am today. I feel so excited about what I’ve learned, and I just want to keep growing in that field. I highly encourage to take Colt Steele’s Course “The Web Developer Bootcamp.” This course is very informative and contains pretty much everything you need to know to start in web development.\n\nHere is the course link: https://www.udemy.com/the-web-developer-bootcamp/ Have fun learning!","tags":["Javascript","React","NodeJS"],"author":{"id":"cjw3ortfby01008308bgz1fp8","name":"Jamie Vardy"}}]},"path":"/"}
